Callum-Sinclair/Bike_monitoring_nrf/speed_nrf51/rsc_based/ble_peripheral/ble_app_rscs/main.c
/**@brief Function for handling the Device Manager events.
 *
 * @param[in]   p_evt   Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle,
                                           dm_event_t const  * p_event,
                                           ret_code_t        event_result)
{
    APP_ERROR_CHECK(event_result);
    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = erase_bonds};
    dm_application_param_t register_param;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));
    
    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

void reed_sw_init(uint32_t pin)
{
    // Sets TIMER4's counter to be incremented each time "pin" is toggled
    // This uses PPI channel 0-3 and TIMER4&3 (defined at top)
    // De-bouncing with a 4 ms 
    gpio_pin_in_init(pin);
    //GPIOTE setup
    NRF_GPIOTE->CONFIG[0] = ((GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) | \
                             (pin << GPIOTE_CONFIG_PSEL_Pos) | \
                             (GPIOTE_CONFIG_POLARITY_LoToHi << GPIOTE_CONFIG_POLARITY_Pos));
    //Timer(Counter) setup
    rotation_counter->MODE = TIMER_MODE_MODE_Counter;
    rotation_counter->BITMODE = TIMER_BITMODE_BITMODE_16Bit;
    rotation_counter->TASKS_CLEAR = 1;
    rotation_counter->TASKS_START = 1;
    //Timer (debounce) setup
    debounce_timer->MODE = TIMER_MODE_MODE_Timer;
    debounce_timer->BITMODE = TIMER_BITMODE_BITMODE_32Bit;
    debounce_timer->PRESCALER = 4; //gives T=0.01ms
    
    debounce_timer->CC[0] = 1;  // 0.01 ms
    debounce_timer->CC[1] = 4000; // 40 ms
    
    debounce_timer->TASKS_CLEAR = 1;
    debounce_timer->TASKS_START = 1;
    //PPI setup
    NRF_PPI->CH[0].EEP = (uint32_t)&(NRF_GPIOTE->EVENTS_IN[0]);
    NRF_PPI->CH[0].TEP = (uint32_t)&(rotation_counter->TASKS_COUNT);
    
    NRF_PPI->CH[1].EEP = (uint32_t)&(NRF_GPIOTE->EVENTS_IN[0]);
    NRF_PPI->CH[1].TEP = (uint32_t)&(debounce_timer->TASKS_CLEAR);
    
    NRF_PPI->CH[2].EEP = (uint32_t)&(debounce_timer->EVENTS_COMPARE[0]);
    NRF_PPI->CH[2].TEP = (uint32_t)&(rotation_counter->TASKS_STOP);
    
    NRF_PPI->CH[3].EEP = (uint32_t)&(debounce_timer->EVENTS_COMPARE[1]);
    NRF_PPI->CH[3].TEP = (uint32_t)&(rotation_counter->TASKS_START);
    
    
    NRF_PPI->CHENSET = 0xF;

}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    rotation_counter = NRF_TIMER2;
    debounce_timer = NRF_TIMER1;

    // Initialize.
    bat_adc_init(BAT_PIN);
    app_trace_init();
    timers_init();
    ble_stack_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    reed_sw_init(READ_SW_PIN);

    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    reed_sw_init(READ_SW_PIN);

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}


/**
 * @}
 */
